app/views/users/index.html.erb

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = $1  [["user_id", 1]]
---
    <% if is_charity? %>
      <% current_user.campaigns.each do |campaign| %>

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 11]]
---
    <% else %>
      <% current_user.photos.each do |photo| %>