app/controllers/campaigns_controller.rb

  def index
    @campaigns = Campaign.all
---
SELECT "campaigns".* FROM "campaigns"

  def create
    @campaign = Campaign.new(campaign_params)

    respond_to do |format|
      if @campaign.save
---
INSERT INTO "campaigns" ("title", "description", "created_at", "updated_at", "campaign_logo") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Charity Prova"], ["description", "prova"], ["created_at", 2016-08-08 13:15:49 UTC], ["updated_at", 2016-08-08 13:15:49 UTC], ["campaign_logo", "2015-11-17_05.53.55_2.jpg"]]

  def destroy
    @campaign.destroy
---
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 3]]

    def set_campaign
      @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]