app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)
    @photo.user = current_user
    @photo.campaign = @campaign

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("title", "location", "description", "created_at", "updated_at", "campaign_pic") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Prova Photo"], ["location", "Prova"], ["description", "Prova"], ["created_at", 2016-08-08 08:27:00 UTC], ["updated_at", 2016-08-08 08:27:00 UTC], ["campaign_pic", "Avatar-Quadrato.jpg"]]

    def set_campaign
      @campaign = Campaign.find(params[:campaign_id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]