app/views/campaigns/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."campaign_id" = $1  [["campaign_id", 1]]
---
  <div class="card-deck">
    <% @campaign.photos.each do |photo| %>